function getUserInfo() {

    const YEAR = +prompt('Вітаю! Підкажіть, будь ласка, ваш рік народження');
    if (YEAR === false || isNaN(YEAR) || YEAR === '' || YEAR === 0) {
        alert("Шкода, що Ви не захотіли ввести свій рік народження. Для повторної відповіді - оновіть сторінку");
        return;
    } else {
        let currentYear = new Date().getFullYear();
        let age = currentYear - YEAR;
        alert(`Ваш вік: ${age}`)
    }

    const CITY = prompt('В якому місті Ви проживаєте? Укажіть місто українською');
    console.log(CITY);
    if (CITY === false || CITY === '' || CITY === 0) {
        alert("Шкода, що Ви не захотіли ввести місто в якому проживаєте. Для повторної відповіді - оновіть сторінку");
        return;
    } else {
        switch (CITY) {
            case "Київ": alert(`Ви проживаєте в столиці України. Ваше місто ${CITY}`);
                break
            case "Лондон": alert(`Ви проживаєте в столиці Англії. Ваше місто ${CITY}`);
                break;
            case "Дніпро": alert(`Ваша столиця місто Київ. Ваше місто ${CITY}`);
                break
            case "Нідерланди": alert(`Ваше місто ${CITY}, а його столиця - Амстердам`);
                break;
            case "Вашингтон": alert(`Ви проживаєте в столиці США. Вітаю Вас і трішки заздрю`);
                break;
            case "Берлін": alert(`Ви проживаєте в столиці Германії`);
                break;
            case "Гамбурег": alert(`Ваше місто ${CITY}, а його столиця - Берлін`);
                break;
            default:
                alert(`На жаль, я не знаю такого міста чи засновник цього скрипта просто полінився розширити список міст та столиць, тому єдине, що я скажу - Ви проживаєте в ${CITY}`);
                break;
        }
    }

    const SPORT = prompt('Який вид спорту Вам подобається? Укажіть вид спорту українською');
    if (SPORT === false  || SPORT === '' || SPORT === 0) {
        alert("Шкода, що Ви не захотіли ввести Ваш улюблений вид спорту. Для повторної відповіді - оновіть сторінку");
        return;
    } else {
        switch (SPORT) {
            case "Теніс": alert(`Ваш улюблений Вид спорту: ${SPORT}. Чемпіоном цього виду спорту вважається - Стефан Едберг`);
                break
            case "Футбол": alert(`Ваш улюблений Вид спорту: ${SPORT}. Чемпіоном цього виду спорту вважається - Ліонель Мессі`);
                break;
            case "Баскетбол": alert(`Ваш улюблений Вид спорту: ${SPORT}. Чемпіоном цього виду спорту вважається - Хосе Кальдерон`);
                break
            case "Бадмінтон": alert(`Ваш улюблений Вид спорту: ${SPORT}. Чемпіоном цього виду спорту вважається - Євтушенко Вікторія`);
                break;
            case "Горілка": alert(`Ваш улюблений Вид спорту: ${SPORT}. Чемпіоном цього виду спорту вважається - Стефан Едберг`);
                break;
            default:
                alert(`На жаль, я не знаю такого спорту чи засновник цього скрипта просто полінився розширити його список, тому єдине, що я скажу - Вам подобається ${SPORT}`);
                break;
        }
    } 
}

getUserInfo();
